In [ ]:
#45. Memadukan loc dan iloc untuk melakukan seleksi data

In [2]:
import pandas as pd
import numpy as np

In [ ]:
# Persiapan Data Frame
df = pd.read_csv('titanicfull.csv')
df.head()

In [ ]:
# Memadukan loc dan iloc untuk melakukan seleksi data
df.iloc[15:20, :].loc[:, 'name':'age']

In [ ]:
df.loc[:, 'name':'age'].iloc[15:20, :]

In [ ]:
#46. Seleksi weekdays dan weekends pada data deret waktu (time series)

In [3]:
# Persiapan Data Frame
n_rows = 365
n_cols = 2
cols = ['col1', 'col2']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)

df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df

C:\Users\PAVILION15\anaconda3\lib\site-packages\pandas\util\__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

            col1  col2
2000-01-01    17    16
2000-01-02    18    19
2000-01-03     8    16
2000-01-04     9    17
2000-01-05     5     2
...          ...   ...
2000-12-26     6    12
2000-12-27     5     1
2000-12-28     9    16
2000-12-29     9     7
2000-12-30    14     9

[365 rows x 2 columns]

In [4]:
#Seleksi weekdays dan weekends
weekdays_df = df[df.index.dayofweek.isin([0, 1, 2, 3, 4])]
weekdays_df.head(7)

            col1  col2
2000-01-03     8    16
2000-01-04     9    17
2000-01-05     5     2
2000-01-06    13     5
2000-01-07    16     6
2000-01-10     2    16
2000-01-11    19    12

In [5]:
weekends_df = df[df.index.dayofweek.isin([5, 6])]
weekends_df.head(7)

            col1  col2
2000-01-01    17    16
2000-01-02    18    19
2000-01-08    19    18
2000-01-09     2    11
2000-01-15    15     6
2000-01-16    10    14
2000-01-22     9    12

In [ ]:
#47. Deteksi dan penanganan kolom dengan tipe data beragam (mixed data types)

In [6]:
# Persiapan Data Frame
d = {'nama':['bejo', 'tejo', 'wati', 'tiwi', 'cecep'], 
     'ipk':[2, '3', 3, 2.75, '3.25']}
df = pd.DataFrame(d)
df

    nama   ipk
0   bejo     2
1   tejo     3
2   wati     3
3   tiwi  2.75
4  cecep  3.25

In [7]:
# Deteksi dan penanganan kolom dengan tipe data beragam (mixed data types)

df.dtypes

nama    object
ipk     object
dtype: object

In [8]:
df['ipk'].apply(type)

0      <class 'int'>
1      <class 'str'>
2      <class 'int'>
3    <class 'float'>
4      <class 'str'>
Name: ipk, dtype: object

In [9]:
df['ipk'].apply(type).value_counts()

<class 'str'>      2
<class 'int'>      2
<class 'float'>    1
Name: ipk, dtype: int64

In [12]:
df['ipk'] = df['ipk'].astype(float)

In [11]:
df['ipk'].apply(type).value_counts()

<class 'float'>    5
Name: ipk, dtype: int64

In [13]:
#48. Mengenal Cummulative Count dengan cumcount()

In [14]:
# Persiapan Data Frame
d = {'penjual':['bejo', 'tejo', 'wati', 'bejo', 'cecep', 'tejo', 'wati', 'bejo'], 
     'barang':['monitor', 'monitor', 'keyboard', 'mouse', 'keyboard', 'monitor', 'laptop', 'monitor']}

df = pd.DataFrame(d)
df

  penjual    barang
0    bejo   monitor
1    tejo   monitor
2    wati  keyboard
3    bejo     mouse
4   cecep  keyboard
5    tejo   monitor
6    wati    laptop
7    bejo   monitor

In [ ]:
# Mengenal Cummulative Count dengan cumcount()

In [15]:
df['count_tiap_penjual'] = df.groupby('penjual').cumcount() + 1
df

  penjual    barang  count_tiap_penjual
0    bejo   monitor                   1
1    tejo   monitor                   1
2    wati  keyboard                   1
3    bejo     mouse                   2
4   cecep  keyboard                   1
5    tejo   monitor                   2
6    wati    laptop                   2
7    bejo   monitor                   3

In [16]:
df['count_tiap_barang'] = df.groupby('barang').cumcount() + 1
df

  penjual    barang  count_tiap_penjual  count_tiap_barang
0    bejo   monitor                   1                  1
1    tejo   monitor                   1                  2
2    wati  keyboard                   1                  1
3    bejo     mouse                   2                  1
4   cecep  keyboard                   1                  2
5    tejo   monitor                   2                  3
6    wati    laptop                   2                  1
7    bejo   monitor                   3                  4

In [17]:
df['count_pasangan_kolom'] = df.groupby(['penjual', 'barang']).cumcount() + 1
df

,penjual,barang,count_tiap_penjual,count_tiap_barang,count_pasangan_kolom
0,bejo,monitor,1,1,1
1,tejo,monitor,1,2,1
2,wati,keyboard,1,1,1
3,bejo,mouse,2,1,1
4,cecep,keyboard,1,2,1
5,tejo,monitor,2,3,2
6,wati,laptop,2,1,1
7,bejo,monitor,3,4,2